app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (start_date >= '2019-04-11' AND start_date <= '2019-07-11')
---
  def upcoming_events
	now = Date.today
	three = Date.today.next_month(3)
	@event = Event.where('start_date >= ? AND start_date <= ?', now, three)