app/controllers/tickets_controller.rb

  def destroy
	@ticket = Ticket.find(params[:id]).destroy
---
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 15]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def index
	@ticket = Ticket.all
---
SELECT "tickets".* FROM "tickets"