app/controllers/users_controller.rb

  def create
	@user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "password", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Isidora"], ["email", "isi@mail.com"], ["password", "123"], ["address", "calle"], ["created_at", "2019-04-10 14:12:31.580528"], ["updated_at", "2019-04-10 14:12:31.580528"]]

  def destroy
	@user = User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
	respond_to do |format|
		if User.find(params[:id]).update(user_params)
			@user = User.find(params[:id]).update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password" = ?, "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "dora"], ["email", "isi@mail.com"], ["password", "123"], ["address", "calle"], ["updated_at", "2019-04-10 14:31:35.655368"], ["id", 1]]

  def hola
	@user = User.all
---
SELECT "users".* FROM "users"

  def user_with_most_tickets
	@user = User.joins(:orders => :tickets).group(:user_id).order('COUNT(tickets.id) DESC').count.first
	out = 'The user with id: ' "#{@user.first}" ' has ' "#{ @user.second}"' tickets'
---
SELECT  "users".* FROM "users" INNER JOIN "orders" ON "orders"."user_id" = "users"."id" INNER JOIN "tickets" ON "tickets"."order_id" = "orders"."id" GROUP BY "user_id" ORDER BY COUNT(users.id) DESC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) AS count_all, "user_id" AS user_id FROM "users" INNER JOIN "orders" ON "orders"."user_id" = "users"."id" INNER JOIN "tickets" ON "tickets"."order_id" = "orders"."id" GROUP BY "user_id" ORDER BY COUNT(tickets.id) DESC
SELECT "users".* FROM "users" INNER JOIN "orders" ON "orders"."user_id" = "users"."id" INNER JOIN "tickets" ON "tickets"."order_id" = "orders"."id" GROUP BY "user_id" ORDER BY COUNT(users.id) DESC